Revit 2026 API

# MetalMetalColor Property

---

The property labeled "Color" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MetalColor { get; }
```
```vb
Public Shared ReadOnly Property MetalColor As String
	Get
```
```cpp
public:
static property String^ MetalColor {
	String^ get ();
}
```
```fsharp
static member MetalColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Metal Class

Autodesk.Revit.DB.Visual Namespace